# CLI-Calculator:
A command-line calculator that takes input from the user using command-line arguments.
The program allow users to perform basic arithmetic operations such as addition, subtraction, multiplication, and division.
<p>&nbsp;</p>

## How to Use?
To run the project, use the following command:
```bash
python Calculator.py
````
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/HowToUse.gif)
<p>&nbsp;</p>

### Add Operation
```bash
python Calculator.py add number1 number2 number3 ....
```

Example:
```bash
output:
The sum of 10.0, 20.0 is: 30.0
```
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/Add1.gif)
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/Add2.gif)
<p>&nbsp;</p>


### Subtract Operation
```bash
python Calculator.py subtract numbers1 number2 number3 ...
```

Example:
```bash
python Calculator.py subtract 100 20 30

output:
The difference between 100.0 and 20.0, 30.0 is: 50.0
```
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/subtract.gif)
<p>&nbsp;</p>


### Multiply Operation
```bash
python Calculator.py multiple numbers1 number2 number3 ...
```

Example:
```bash
python Calculator.py multiply 5 7 3 12

output:
The product of 5.0, 7.0, 3.0, 12.0 is: 1260.0
```
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/multiply.gif)
<p>&nbsp;</p>


### Division Operation
```bash
python Calculator.py divide numbers1 number2 number3 ...
```

Example:
```bash
python Calculator.py divide 7 3

output:
The division of 7.0 by 3.0 is: 2.3333333333333335
```
![](https://github.com/mr-hosseinaskarii/argparse/blob/main/CLI-Calculator/readme/devivde.gif)
